b()
=====
b(B)
=====
b(X)
=====
b(B00000000)
=====
b(X00000000)
=====
b(Xff)
=====
b(B0000111100001111_00001111)
=====
b(X0011_ff_ee)
=====
b(0123456789abcdef)
