(1)
=====
(((1)))
=====
[(1)]
=====
1 2 []
=====
1 [] 2
=====
(1 2 (3 4 5)) 6 7
=====
(1 2 3) []
=====
<(1 2 3 4 5)
=====
>(1 2 3 4 5)
=====
!(1 2 3 4 5)
=====
?(1 2 3 4 5)
=====
?(1 2)
=====
<!(1 2 3 4 5)
=====
<?(1 2 3 4 5)
=====
>!(1 2 3 4 5)
=====
>?(1 2 3 4 5)
=====
^()
=====
^( )
=====
^(1)
=====
^(1 )
=====
^(1 2)
=====
^(@ ! : ?)
=====
^(^)
=====
^((a b c) d e)
=====
^((a ! b) c d)
=====
^([1, 2,] [])
=====
^({a : b} {})
=====
^(a ^(b c) d)
